---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.ActiveAddInId
source: html/ff42e969-2daf-d436-2ded-860e87195823.htm
---
# Autodesk.Revit.UI.UIApplication.ActiveAddInId Property

Get current active external application or external command id.

## Syntax (C#)
```csharp
public AddInId ActiveAddInId { get; }
```